packages.org
#+TITLE: Emacs Literate Package Additions
#+AUTHOR: Rohit Goswami (HaoZeke) <rohit.goswami@aol.com>
#+DATE: 2020:04:09
#+HTML_LINK_HOME: https://dotdoom.rgoswami.me
#+HTML_HEAD_EXTRA: <script> window.goatcounter = { path: '/dotdoomhome', }; </script>
#+HTML_HEAD_EXTRA: <script data-goatcounter="https://rgoswami.goatcounter.com/count" async src="//gc.zgo.at/count.js"></script>
#+PROPERTY: header-args+ :tangle (concat doom-private-dir "packages.el")
#+PROPERTY: header-args+ :comments link
#+STARTUP: outline
#+OPTIONS: toc:nil

# Now we set this with STARTUP
# These can be set per subtree.
# :PROPERTIES:
# :VISIBILITY: children
# :END:

** Table of Contents :TOC_3_gh:noexport:
  - [[#about-this-file][About this file]]
    - [[#about-that-toc][About that TOC..]]
    - [[#the-properties][The properties]]
  - [[#os-specific-packages][OS Specific Packages]]
    - [[#macos][MacOS]]
  - [[#aesthetic-packages][Aesthetic Packages]]
    - [[#dired-icons][Dired Icons]]
    - [[#wakatime][Wakatime]]
  - [[#later-magit-additions][LATER Magit Additions]]
    - [[#magit-delta][Magit Delta]]
  - [[#key-chords-and-keybindings][Key Chords and Keybindings]]
  - [[#evil-colemak][Evil Colemak]]
  - [[#firestarter][Firestarter]]
  - [[#org-additions][Org Additions]]
    - [[#mermaid][Mermaid]]
    - [[#org-download][Org Download]]
    - [[#later-org-drill][LATER Org Drill]]
    - [[#org-protocol-updates][Org Protocol Updates]]
    - [[#org-noter][Org Noter]]
    - [[#org-ref][Org Ref]]
    - [[#org-mind-map][Org Mind Map]]
    - [[#org-rifle][Org Rifle]]
    - [[#org-async][Org Async]]
    - [[#anki-mode][Anki Mode]]
    - [[#org-re-reveal-extensions][Org Re-Reveal Extensions]]
    - [[#org-roam-bibtex][Org Roam Bibtex]]
    - [[#org-gcal][Org GCal]]
    - [[#citeproc-org][Citeproc Org]]
  - [[#dockerfile-mode][Dockerfile Mode]]
  - [[#reference-management][Reference Management]]
  - [[#syntax-highlighting][Syntax Highlighting]]
    - [[#sphinx-and-rst][Sphinx and RsT]]
    - [[#cpp-additions][CPP Additions]]
    - [[#quarto-mode][Quarto Mode]]
    - [[#meson-mode][Meson Mode]]
    - [[#tup-mode][Tup Mode]]
    - [[#saltstack-mode][SaltStack Mode]]
    - [[#pkgbuild-mode][PKGBUILD Mode]]
    - [[#lammps-mode][LAMMPS Mode]]
    - [[#pug-mode][Pug Mode]]
    - [[#nix-mode][Nix Mode]]
    - [[#vim-mode][VIM mode]]
    - [[#jvm-languages][JVM Languages]]
    - [[#systemd-mode][Systemd Mode]]
    - [[#dart-mode][Dart Mode]]
    - [[#wolfram-mode][Wolfram Mode]]
    - [[#polymode][Polymode]]
    - [[#snakemake][Snakemake]]
  - [[#matrix-clients][Matrix Clients]]
  - [[#flycheck-additions][Flycheck Additions]]
    - [[#melpa-helper][MELPA Helper]]
  - [[#snippets][Snippets]]
    - [[#doom][Doom]]
    - [[#standard][Standard]]
  - [[#math-support][Math support]]

** About this file
This is an Emacs literate package file and is meant to compliment [[file:config.org][my
configuration]], as well as [[file:index.html][the init.el]]. It contains the basic structure along
with some data about each package and why it's needed. This is to be used in
tandem with the ~define-package!~ function in ~config.org~.

Since it's primarily aimed at ~doom-emacs~ let's add their comments.

#+BEGIN_SRC emacs-lisp
;; -*- no-byte-compile: t; -*-
;;; ~/.config/doom/packages.el
#+END_SRC

*** About that TOC..
So as mentioned [[https://github.com/snosov1/toc-org/issues/35][here]] there is trouble when ~org-export~ tries to create files
while keeping the ~org-toc~ tag.

It's not really a problem since ~org-export~ actually generates a TOC for the
files anyway.
*** The properties
Basically, the properties set imply that the file is to be tangled for every
block and moreover the output directory is the ~doom-private-dir~. It's
practically self explanatory but still. 

The filename is determined by the ~SRC~ block languages.
** OS Specific Packages
*** MacOS
Paths are a nightmare on ~darwin~ systems which necessitates a separate package [[https://github.com/purcell/exec-path-from-shell][for setting things up]].
#+begin_src emacs-lisp :tangle yes
(cond (IS-MAC (package! exec-path-from-shell)
              ))
#+end_src
** Aesthetic Packages
*** Dired Icons
Since treemacs already uses ~all-the-icons~ it is silly to not use them in
dired, from the [[https://github.com/domtronn/all-the-icons.el/wiki][all-the-icons wiki]].
#+BEGIN_SRC emacs-lisp :tangle yes
(package! all-the-icons-dired)
#+END_SRC
*** Wakatime
Not exactly aesthetic, but yeah, for stats.
#+BEGIN_SRC emacs-lisp :tangle yes
(package! wakatime-mode)
#+END_SRC
** LATER Magit Additions
These basically allow for TODOs in magit along with enhanced github integration.
These have been added upstream in ~develop~.

#+BEGIN_SRC emacs-lisp :tangle no
(package! magit-org-todos)
(package! magithub)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle no
(package! magit-todos)
#+END_SRC

Actually [[https://github.com/alphapapa/magit-todos][magit-todos]] has been added upstream which collates all ~todo~ items.
There might still be workflows where [[https://github.com/danielma/magit-org-todos.el][magit-org-todos]] is useful since that
displays a global ~todo.org~ file.
*** DONE Magit Delta
CLOSED: [2022-01-21 Fri 10:44]
#+begin_src emacs-lisp :tangle yes
(package! magit-delta)
#+end_src

