docs/packages.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-24 Sat 13:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Literate Package Additions</title>
<meta name="author" content="Rohit Goswami (HaoZeke) &lt;rohit.goswami@aol.com&gt;" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://thomasf.github.io/solarized-css/solarized-dark.min.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://dotdoom.rgoswami.me"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Emacs Literate Package Additions</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc48a05d">1. About this file</a>
<ul>
<li><a href="#org28999b5">1.1. About that TOC..</a></li>
<li><a href="#orge8f2cef">1.2. The properties</a></li>
</ul>
</li>
<li><a href="#orgaa50a35">2. OS Specific Packages</a>
<ul>
<li><a href="#org7c93d52">2.1. MacOS</a></li>
</ul>
</li>
<li><a href="#org5ce884c">3. Aesthetic Packages</a>
<ul>
<li><a href="#org5f2a1f8">3.1. Dired Icons</a></li>
<li><a href="#orgf84d382">3.2. Wakatime</a></li>
</ul>
</li>
<li><a href="#orgd0af3d0">4. LATER Magit Additions</a>
<ul>
<li><a href="#org0b36b04">4.1. <span class="done DONE">DONE</span> Magit Delta</a></li>
</ul>
</li>
<li><a href="#orgaf3edaa">5. <span class="done DONE">DONE</span> Key Chords and Keybindings</a></li>
<li><a href="#org77124f3">6. Evil Colemak</a></li>
<li><a href="#org218b54e">7. Firestarter</a></li>
<li><a href="#org1615045">8. Org Additions</a>
<ul>
<li><a href="#org0d8bc29">8.1. Mermaid</a></li>
<li><a href="#org9fd5511">8.2. Org Download</a></li>
<li><a href="#org00881a3">8.3. LATER Org Drill</a></li>
<li><a href="#org450450d">8.4. Org Protocol Updates</a></li>
<li><a href="#orgdfec17e">8.5. <span class="todo TODO">TODO</span> Org Noter</a></li>
<li><a href="#orgb6f965e">8.6. Org Ref</a></li>
<li><a href="#org3842598">8.7. Org Mind Map</a></li>
<li><a href="#org699b5c0">8.8. Org Rifle</a></li>
<li><a href="#org7557feb">8.9. Org Async</a></li>
<li><a href="#org30493e1">8.10. Anki Mode</a></li>
<li><a href="#org7f9fea6">8.11. Org Re-Reveal Extensions</a></li>
<li><a href="#org6108d5e">8.12. Org Roam Bibtex</a></li>
<li><a href="#org2a608d2">8.13. Org GCal</a></li>
<li><a href="#org46eeeec">8.14. Citeproc Org</a></li>
</ul>
</li>
<li><a href="#org06b87eb">9. Dockerfile Mode</a></li>
<li><a href="#orgf318ace">10. Reference Management</a>
<ul>
<li>
<ul>
<li><a href="#org48cebeb">10.0.1. Zotero</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7c15825">11. Syntax Highlighting</a>
<ul>
<li><a href="#org9ec0b74">11.1. Sphinx and RsT</a></li>
<li><a href="#org23c68c8">11.2. CPP Additions</a></li>
<li><a href="#orge15734d">11.3. Quarto Mode</a></li>
<li><a href="#orga580875">11.4. Meson Mode</a></li>
<li><a href="#org71438c4">11.5. Tup Mode</a>
<ul>
<li><a href="#org02b0343">11.5.1. LATER Caveats</a></li>
</ul>
</li>
<li><a href="#orgca19f13">11.6. SaltStack Mode</a></li>
<li><a href="#org5f22408">11.7. PKGBUILD Mode</a></li>
<li><a href="#orgd40d29c">11.8. LAMMPS Mode</a></li>
<li><a href="#orgf5a7d0a">11.9. Pug Mode</a></li>
<li><a href="#org1906901">11.10. Nix Mode</a></li>
<li><a href="#orgf1dd217">11.11. VIM mode</a></li>
<li><a href="#org415c708">11.12. JVM Languages</a></li>
<li><a href="#org8606104">11.13. Systemd Mode</a></li>
<li><a href="#org6ea8e7f">11.14. Dart Mode</a></li>
<li><a href="#org5dae54b">11.15. Wolfram Mode</a></li>
<li><a href="#orgc75b6dc">11.16. Polymode</a></li>
<li><a href="#orgdb6d893">11.17. Snakemake</a></li>
</ul>
</li>
<li><a href="#org0babbcd">12. Matrix Clients</a></li>
<li><a href="#org98f7f73">13. Flycheck Additions</a>
<ul>
<li><a href="#org0ec2424">13.1. MELPA Helper</a></li>
</ul>
</li>
<li><a href="#orgb5e5403">14. Snippets</a>
<ul>
<li><a href="#orgee3de81">14.1. Doom</a></li>
<li><a href="#org8f38e27">14.2. Standard</a></li>
</ul>
</li>
<li><a href="#org38e9d9e">15. Math support</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc48a05d" class="outline-2">
<h2 id="orgc48a05d"><span class="section-number-2">1.</span> About this file</h2>
<div class="outline-text-2" id="text-1">
<p>
This is an Emacs literate package file and is meant to compliment <a href="config.html">my
configuration</a>, as well as <a href="index.html">the init.el</a>. It contains the basic structure along
with some data about each package and why it&rsquo;s needed. This is to be used in
tandem with the <code>define-package!</code> function in <code>config.org</code>.
</p>

<p>
Since it&rsquo;s primarily aimed at <code>doom-emacs</code> let&rsquo;s add their comments.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #727072;">;; </span><span style="color: #727072;">-*- no-byte-compile: t; -*-</span>
<span style="color: #727072;">;;; </span><span style="color: #727072;">~/.config/doom/packages.el</span>
</pre>
</div>
</div>

<div id="outline-container-org28999b5" class="outline-3">
<h3 id="org28999b5"><span class="section-number-3">1.1.</span> About that TOC..</h3>
<div class="outline-text-3" id="text-1-1">
<p>
So as mentioned <a href="https://github.com/snosov1/toc-org/issues/35">here</a> there is trouble when <code>org-export</code> tries to create files
while keeping the <code>org-toc</code> tag.
</p>

<p>
It&rsquo;s not really a problem since <code>org-export</code> actually generates a TOC for the
files anyway.
</p>
</div>
</div>
<div id="outline-container-orge8f2cef" class="outline-3">
<h3 id="orge8f2cef"><span class="section-number-3">1.2.</span> The properties</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Basically, the properties set imply that the file is to be tangled for every
block and moreover the output directory is the <code>doom-private-dir</code>. It&rsquo;s
practically self explanatory but still. 
</p>

<p>
The filename is determined by the <code>SRC</code> block languages.
</p>
</div>
</div>
</div>
<div id="outline-container-orgaa50a35" class="outline-2">
<h2 id="orgaa50a35"><span class="section-number-2">2.</span> OS Specific Packages</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7c93d52" class="outline-3">
<h3 id="org7c93d52"><span class="section-number-3">2.1.</span> MacOS</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Paths are a nightmare on <code>darwin</code> systems which necessitates a separate package <a href="https://github.com/purcell/exec-path-from-shell">for setting things up</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">cond</span> <span style="color: #78DCE8;">(</span><span style="color: #FCFCFA;">IS-MAC</span> <span style="color: #FC9867;">(</span><span style="color: #FF6188;">package!</span> exec-path-from-shell<span style="color: #FC9867;">)</span>
              <span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5ce884c" class="outline-2">
<h2 id="org5ce884c"><span class="section-number-2">3.</span> Aesthetic Packages</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5f2a1f8" class="outline-3">
<h3 id="org5f2a1f8"><span class="section-number-3">3.1.</span> Dired Icons</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Since treemacs already uses <code>all-the-icons</code> it is silly to not use them in
dired, from the <a href="https://github.com/domtronn/all-the-icons.el/wiki">all-the-icons wiki</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> all-the-icons-dired<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf84d382" class="outline-3">
<h3 id="orgf84d382"><span class="section-number-3">3.2.</span> Wakatime</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Not exactly aesthetic, but yeah, for stats.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> <span style="color: #FCFCFA;">wakatime-mode</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd0af3d0" class="outline-2">
<h2 id="orgd0af3d0"><span class="section-number-2">4.</span> LATER Magit Additions</h2>
<div class="outline-text-2" id="text-4">
<p>
These basically allow for TODOs in magit along with enhanced github integration.
These have been added upstream in <code>develop</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> magit-org-todos<span style="color: #AB9DF2;">)</span>
<span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> magithub<span style="color: #AB9DF2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> magit-todos<span style="color: #AB9DF2;">)</span>
</pre>
</div>

<p>
Actually <a href="https://github.com/alphapapa/magit-todos">magit-todos</a> has been added upstream which collates all <code>todo</code> items.
There might still be workflows where <a href="https://github.com/danielma/magit-org-todos.el">magit-org-todos</a> is useful since that
displays a global <code>todo.org</code> file.
</p>
</div>
<div id="outline-container-org0b36b04" class="outline-3">
<h3 id="org0b36b04"><span class="section-number-3">4.1.</span> <span class="done DONE">DONE</span> Magit Delta</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> magit-delta<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
</div>
