packages.el
;; [[file:~/.config/doom/packages.org::*Wakatime][Wakatime:1]]
(package! wakatime-mode)
;; Wakatime:1 ends here
