packages.org
** DONE Key Chords and Keybindings
It turns out that the switch to [[https://github.com/noctuid/general.el][general.el]] is both inevitable (doom version 2.1)
and very rational. However, I really can't wait. So.. This is a stop gap solution.
#+BEGIN_SRC emacs-lisp :tangle no
(package! general)
#+END_SRC
- [x] Remove when it's merged upstream
** Evil Colemak
I guess I just gave up, [[https://github.com/wbolster/evil-colemak-basics][from here]]. Read about why [[https://rgoswami.me/posts/colemak-dots-refactor/][here]]. The visual line mode setup leverages [[https://github.com/YourFin/evil-better-visual-line/][this package]].
#+begin_src emacs-lisp :tangle yes
(package! evil-colemak-basics)
(package! evil-better-visual-line)
#+end_src

** Firestarter
For running shell commands on-save.

#+BEGIN_SRC emacs-lisp :tangle yes
(package! firestarter)
#+END_SRC

** Org Additions
The new ones need to be covered in the ~config.org~ file with the appropriate
keybindings. The notes are [[https://rgoswami.me/posts/org-note-workflow][described here]].
*** Mermaid
Technically not only an org addition, [[https://mermaid-js.github.io/mermaid/#/][mermaid is kinda]] like a souped up ~ditaa~. Naturally there's an [[https://github.com/arnm/ob-mermaid][org mode addition]].
#+begin_src emacs-lisp :tangle yes
(package! mermaid-mode)
(package! ob-mermaid)
#+end_src
*** Org Download
Now I load it here since I don't use ~+attach~.
#+BEGIN_SRC emacs-lisp :tangle yes
(package! org-download
  :recipe (:host github
            :repo "abo-abo/org-download"))
#+END_SRC

*** LATER Org Drill
The [[https://bitbucket.org/eeeickythump/org-drill/src][actual repo]] has not been updated in 3 years, so I must use [[https://github.com/hakanserce/org-drill][this fork]].
#+BEGIN_SRC emacs-lisp :tangle yes
(package! org-drill
  :recipe (:host github
            :repo "hakanserce/org-drill"))
#+END_SRC

*** Org Protocol Updates
This needs to be installed specially, [[https://github.com/alphapapa/org-protocol-capture-html][from this repo]].
#+BEGIN_SRC emacs-lisp :tangle yes
(package! org-protocol-capture-html
  :recipe (:host github
           :repo "alphapapa/org-protocol-capture-html"))
#+END_SRC
*** TODO Org Noter
This is sort of more of a ~pdf-tools~ extension and it needs it's own ~biblatex~
setup and stuff as well so this might move into a tree of it's own.

#+BEGIN_SRC emacs-lisp :tangle yes
(package! org-noter)
#+END_SRC

This actually breaks the ~pdf-tools~ bindings.

*** Org Ref
This is probably not the best thing in my current setup.. Now part of the ~init.el~ setup.
#+BEGIN_SRC emacs-lisp :tangle yes
(package! org-ref)
#+END_SRC
*** Org Mind Map
Not on MELPA yet. From [[https://github.com/theodorewiles/org-mind-map][here]].
#+BEGIN_SRC emacs-lisp :tangle yes
(package! org-mind-map
  :recipe (:host github
            :repo "theodorewiles/org-mind-map"))
#+END_SRC
*** Org Rifle
Technically a helm addition. Perfect for monolithic ~org~ files. More details
[[https://github.com/alphapapa/helm-org-rifle][here]].
#+BEGIN_SRC emacs-lisp :tangle yes
(package! helm-org-rifle)
#+END_SRC
*** Org Async
We will use this.
#+begin_src emacs-lisp :tangle yes
(package! org-babel-eval-in-repl)
#+end_src
*** Anki Mode
This is put here since it only works with ~org-mode~ stuff.
#+BEGIN_SRC emacs-lisp :tangle yes
(package! anki-editor)
#+END_SRC

*** Org Re-Reveal Extensions
An [[https://gitlab.com/oer/org-re-reveal-ref][extension]] to ~org-re-reveal-ref~. Also [[https://gitlab.com/oer/oer-reveal][this]].
#+begin_src emacs-lisp :tangle yes
(package! org-re-reveal-ref)
#+end_src
*** Org Roam Bibtex
This should be a part of the main ~+roam~ setup, but until then.
#+begin_src emacs-lisp :tangle yes
(package! org-roam-bibtex)
#+end_src
