docs/packages.html

<div id="outline-container-orgaf3edaa" class="outline-2">
<h2 id="orgaf3edaa"><span class="section-number-2">5.</span> <span class="done DONE">DONE</span> Key Chords and Keybindings</h2>
<div class="outline-text-2" id="text-5">
<p>
It turns out that the switch to <a href="https://github.com/noctuid/general.el">general.el</a> is both inevitable (doom version 2.1)
and very rational. However, I really can&rsquo;t wait. So.. This is a stop gap solution.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> general<span style="color: #AB9DF2;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>Remove when it&rsquo;s merged upstream</li>
</ul>
</div>
</div>
<div id="outline-container-org77124f3" class="outline-2">
<h2 id="org77124f3"><span class="section-number-2">6.</span> Evil Colemak</h2>
<div class="outline-text-2" id="text-6">
<p>
I guess I just gave up, <a href="https://github.com/wbolster/evil-colemak-basics">from here</a>. Read about why <a href="https://rgoswami.me/posts/colemak-dots-refactor/">here</a>. The visual line mode setup leverages <a href="https://github.com/YourFin/evil-better-visual-line/">this package</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> evil-colemak-basics <span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:branch</span> <span style="color: #FFD866;">"main"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
<span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> evil-better-visual-line<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org218b54e" class="outline-2">
<h2 id="org218b54e"><span class="section-number-2">7.</span> Firestarter</h2>
<div class="outline-text-2" id="text-7">
<p>
For running shell commands on-save.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> <span style="color: #FCFCFA;">firestarter</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1615045" class="outline-2">
<h2 id="org1615045"><span class="section-number-2">8.</span> Org Additions</h2>
<div class="outline-text-2" id="text-8">
<p>
The new ones need to be covered in the <code>config.org</code> file with the appropriate
keybindings. The notes are <a href="https://rgoswami.me/posts/org-note-workflow">described here</a>.
</p>
</div>
<div id="outline-container-org0d8bc29" class="outline-3">
<h3 id="org0d8bc29"><span class="section-number-3">8.1.</span> Mermaid</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Technically not only an org addition, <a href="https://mermaid-js.github.io/mermaid/#/">mermaid is kinda</a> like a souped up <code>ditaa</code>. Naturally there&rsquo;s an <a href="https://github.com/arnm/ob-mermaid">org mode addition</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> mermaid-mode<span style="color: #AB9DF2;">)</span>
<span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> ob-mermaid<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9fd5511" class="outline-3">
<h3 id="org9fd5511"><span class="section-number-3">8.2.</span> Org Download</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Now I load it here since I don&rsquo;t use <code>+attach</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> org-download
  <span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github
            <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"abo-abo/org-download"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org00881a3" class="outline-3">
<h3 id="org00881a3"><span class="section-number-3">8.3.</span> LATER Org Drill</h3>
<div class="outline-text-3" id="text-8-3">
<p>
The <a href="https://bitbucket.org/eeeickythump/org-drill/src">actual repo</a> has not been updated in 3 years, so I must use <a href="https://github.com/hakanserce/org-drill">this fork</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> org-drill
  <span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github
            <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"hakanserce/org-drill"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org450450d" class="outline-3">
<h3 id="org450450d"><span class="section-number-3">8.4.</span> Org Protocol Updates</h3>
<div class="outline-text-3" id="text-8-4">
<p>
This needs to be installed specially, <a href="https://github.com/alphapapa/org-protocol-capture-html">from this repo</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> org-protocol-capture-html
  <span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github
           <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"alphapapa/org-protocol-capture-html"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdfec17e" class="outline-3">
<h3 id="orgdfec17e"><span class="section-number-3">8.5.</span> <span class="todo TODO">TODO</span> Org Noter</h3>
<div class="outline-text-3" id="text-8-5">
<p>
This is sort of more of a <code>pdf-tools</code> extension and it needs it&rsquo;s own <code>biblatex</code>
setup and stuff as well so this might move into a tree of it&rsquo;s own.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> org-noter<span style="color: #AB9DF2;">)</span>
</pre>
</div>

<p>
This actually breaks the <code>pdf-tools</code> bindings.
</p>
</div>
</div>

<div id="outline-container-orgb6f965e" class="outline-3">
<h3 id="orgb6f965e"><span class="section-number-3">8.6.</span> Org Ref</h3>
<div class="outline-text-3" id="text-8-6">
<p>
This is probably not the best thing in my current setup.. Now part of the <code>init.el</code> setup.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> org-ref<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3842598" class="outline-3">
<h3 id="org3842598"><span class="section-number-3">8.7.</span> Org Mind Map</h3>
<div class="outline-text-3" id="text-8-7">
<p>
Not on MELPA yet. From <a href="https://github.com/theodorewiles/org-mind-map">here</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> org-mind-map
  <span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github
            <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"theodorewiles/org-mind-map"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org699b5c0" class="outline-3">
<h3 id="org699b5c0"><span class="section-number-3">8.8.</span> Org Rifle</h3>
<div class="outline-text-3" id="text-8-8">
<p>
Technically a helm addition. Perfect for monolithic <code>org</code> files. More details
<a href="https://github.com/alphapapa/helm-org-rifle">here</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> helm-org-rifle<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7557feb" class="outline-3">
<h3 id="org7557feb"><span class="section-number-3">8.9.</span> Org Async</h3>
<div class="outline-text-3" id="text-8-9">
<p>
We will use this.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> org-babel-eval-in-repl<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org30493e1" class="outline-3">
<h3 id="org30493e1"><span class="section-number-3">8.10.</span> Anki Mode</h3>
<div class="outline-text-3" id="text-8-10">
<p>
This is put here since it only works with <code>org-mode</code> stuff.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> anki-editor<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f9fea6" class="outline-3">
<h3 id="org7f9fea6"><span class="section-number-3">8.11.</span> Org Re-Reveal Extensions</h3>
<div class="outline-text-3" id="text-8-11">
<p>
An <a href="https://gitlab.com/oer/org-re-reveal-ref">extension</a> to <code>org-re-reveal-ref</code>. Also <a href="https://gitlab.com/oer/oer-reveal">this</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> org-re-reveal-ref<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6108d5e" class="outline-3">
<h3 id="org6108d5e"><span class="section-number-3">8.12.</span> Org Roam Bibtex</h3>
<div class="outline-text-3" id="text-8-12">
<p>
This should be a part of the main <code>+roam</code> setup, but until then.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> org-roam-bibtex<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
