packages.el

;; [[file:~/.config/doom/packages.org::*Evil Colemak][Evil Colemak:1]]
(package! evil-colemak-basics)
;; Evil Colemak:1 ends here

;; [[file:~/.config/doom/packages.org::*Org Download][Org Download:1]]
(package! org-download
  :recipe (:host github
            :repo "abo-abo/org-download"))
;; Org Download:1 ends here

;; [[file:~/.config/doom/packages.org::*Org Protocol Updates][Org Protocol Updates:1]]
(package! org-protocol-capture-html
  :recipe (:host github
           :repo "alphapapa/org-protocol-capture-html"))
;; Org Protocol Updates:1 ends here

;; [[file:~/.config/doom/packages.org::*Org Noter][Org Noter:1]]
(package! org-noter)
;; Org Noter:1 ends here

;; [[file:~/.config/doom/packages.org::*Org Ref][Org Ref:1]]
(package! org-ref)
;; Org Ref:1 ends here

;; [[file:~/.config/doom/packages.org::*Org Mind Map][Org Mind Map:1]]
(package! org-mind-map
  :recipe (:host github
            :repo "theodorewiles/org-mind-map"))
;; Org Mind Map:1 ends here

;; [[file:~/.config/doom/packages.org::*Org Rifle][Org Rifle:1]]
(package! helm-org-rifle)
;; Org Rifle:1 ends here

;; [[file:~/.config/doom/packages.org::*Org Async][Org Async:1]]
(package! org-babel-eval-in-repl)
;; Org Async:1 ends here

;; [[file:~/.config/doom/packages.org::*Org Roam Bibtex][Org Roam Bibtex:1]]
(package! org-roam-bibtex)
;; Org Roam Bibtex:1 ends here
