packages.org
*** Org GCal
This extension seems to be a maintained fork.
#+begin_src emacs-lisp :tangle yes
(package! org-gcal)
#+end_src
*** Citeproc Org
Mainly used with ~ox-hugo~
#+begin_src emacs-lisp :tangle yes
(package! citeproc-org :pin "0fb4c96f48b3055a59a397af24d3f1a82cf77b66")
#+end_src
** Dockerfile Mode
For syntax highlighting and inline builds. [[https://github.com/spotify/dockerfile-mode][From spotify]] weirdly.
~## -*- docker-image-name: "your-image-name-here" -*-~ can be used to specify
the image name.
#+BEGIN_SRC emacs-lisp :tangle yes
(package! dockerfile-mode)
#+END_SRC
** Reference Management
**** Zotero
There are a bunch of ~zotero~ integrations for emacs, most notably, [[https://github.com/vspinu/zotelo][zotelo]], but
they don't seem to be all that well mantained. [[https://github.com/emacsmirror/zotxt][Zotxt]] seems to be updated pretty
often though.

#+BEGIN_SRC emacs-lisp :tangle yes
(package! zotxt)
#+END_SRC
** Syntax Highlighting
These are additionally required to work with the sort of files I use often.
The configuration and settings are as usual in ~config.org~
*** Sphinx and RsT
Though reStructured Text is supported natively, there are some quality of life exporters and packages which should be more useful.
#+begin_src emacs-lisp :tangle yes
(package! ox-rst
  :recipe (:host github
           :repo "msnoigrs/ox-rst"))
(package! sphinx-mode
  :recipe (:host github
           :repo "Fuco1/sphinx-mode"
           :files ("*.el")))
#+end_src
*** CPP Additions
Though the standard ~doom-emacs~ module configuration is a sane set of defaults, there are some glaring omissions, most egregious of is the lack of ~doxygen~ highlighting.
#+begin_src emacs-lisp :tangle yes
(package! highlight-doxygen)
#+end_src
*** Quarto Mode
#+begin_src emacs-lisp :tangle yes
(package! quarto-mode)
#+end_src
*** Meson Mode
Recently gotten into ~meson~ as a nice ~cmake~ alternative for smaller projects (maybe larger ones too).
#+begin_src emacs-lisp :tangle yes
(package! meson-mode)
#+end_src
*** Tup Mode
Because honestly there isn't anything better than [[http://gittup.org/tup/][tup]]. Who doesn't need a build
system which [[http://gittup.org/tup/tup_vs_mordor.html][scales with the eye of Mordor]]?

#+BEGIN_SRC emacs-lisp :tangle yes
(package! tup-mode
:recipe (:host github
           :repo "ejmr/tup-mode"))
#+END_SRC

**** LATER Caveats
The repo is unmaintained so I ought to fork it and take a look into maintaining it.
*** SaltStack Mode
I have recently decided that [[https://saltstack.com/][saltstack]] ought to be used for working on multiple
systems.

#+BEGIN_SRC emacs-lisp :tangle yes
(package! salt-mode
:recipe (:host github
         :repo "glynnforrest/salt-mode"))
#+END_SRC
*** PKGBUILD Mode
No point using ~emacs~ if I can't get highlighting for all my needs. This needs
some extra configuration. +Must figure out if this is well mantained+. The
developer is very responsive to pull requests and the like.

#+BEGIN_SRC emacs-lisp :tangle yes
(package! pkgbuild-mode
  :recipe (:host github
            :repo "juergenhoetzel/pkgbuild-mode"))
#+END_SRC
*** LAMMPS Mode
+This could do with some updates. Will look into this soon. Also it takesunbearably long this way. Must figure out how to stop it from downloading the
whole repo.+
Mantained [[https://github.com/HaoZeke/lammps-mode][by me]] now.
#+BEGIN_SRC emacs-lisp :tangle yes
(package! lammps-mode
  :recipe (:host github
                    :repo "HaoZeke/lammps-mode"))
#+END_SRC
*** Pug Mode
I just like pugs.
#+BEGIN_SRC emacs-lisp :tangle yes
(package! pug-mode)
#+END_SRC
