docs/packages.html
<div id="outline-container-org2a608d2" class="outline-3">
<h3 id="org2a608d2"><span class="section-number-3">8.13.</span> Org GCal</h3>
<div class="outline-text-3" id="text-8-13">
<p>
This extension seems to be a maintained fork.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> org-gcal<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org46eeeec" class="outline-3">
<h3 id="org46eeeec"><span class="section-number-3">8.14.</span> Citeproc Org</h3>
<div class="outline-text-3" id="text-8-14">
<p>
Mainly used with <code>ox-hugo</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> citeproc-org <span style="color: #78DCE8;">:pin</span> <span style="color: #FFD866;">"0fb4c96f48b3..."</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org06b87eb" class="outline-2">
<h2 id="org06b87eb"><span class="section-number-2">9.</span> Dockerfile Mode</h2>
<div class="outline-text-2" id="text-9">
<p>
For syntax highlighting and inline builds. <a href="https://github.com/spotify/dockerfile-mode">From spotify</a> weirdly.
<code>## -*- docker-image-name: "your-image-name-here" -*-</code> can be used to specify
the image name.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> dockerfile-mode<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf318ace" class="outline-2">
<h2 id="orgf318ace"><span class="section-number-2">10.</span> Reference Management</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org48cebeb" class="outline-4">
<h4 id="org48cebeb"><span class="section-number-4">10.0.1.</span> Zotero</h4>
<div class="outline-text-4" id="text-10-0-1">
<p>
There are a bunch of <code>zotero</code> integrations for emacs, most notably, <a href="https://github.com/vspinu/zotelo">zotelo</a>, but
they don&rsquo;t seem to be all that well mantained. <a href="https://github.com/emacsmirror/zotxt">Zotxt</a> seems to be updated pretty
often though.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> zotxt<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7c15825" class="outline-2">
<h2 id="org7c15825"><span class="section-number-2">11.</span> Syntax Highlighting</h2>
<div class="outline-text-2" id="text-11">
<p>
These are additionally required to work with the sort of files I use often.
The configuration and settings are as usual in <code>config.org</code>
</p>
</div>
<div id="outline-container-org9ec0b74" class="outline-3">
<h3 id="org9ec0b74"><span class="section-number-3">11.1.</span> Sphinx and RsT</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Though reStructured Text is supported natively, there are some quality of life exporters and packages which should be more useful.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> ox-rst
  <span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github
           <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"msnoigrs/ox-rst"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
<span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> <span style="color: #FCFCFA;">sphinx-mode</span>
  <span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github
           <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"Fuco1/sphinx-mode"</span>
           <span style="color: #78DCE8;">:files</span> <span style="color: #FC9867;">(</span><span style="color: #FFD866;">"*.el"</span><span style="color: #FC9867;">)</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org23c68c8" class="outline-3">
<h3 id="org23c68c8"><span class="section-number-3">11.2.</span> CPP Additions</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Though the standard <code>doom-emacs</code> module configuration is a sane set of defaults, there are some glaring omissions, most egregious of is the lack of <code>doxygen</code> highlighting.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> highlight-doxygen<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge15734d" class="outline-3">
<h3 id="orge15734d"><span class="section-number-3">11.3.</span> Quarto Mode</h3>
<div class="outline-text-3" id="text-11-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> quarto-mode<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga580875" class="outline-3">
<h3 id="orga580875"><span class="section-number-3">11.4.</span> Meson Mode</h3>
<div class="outline-text-3" id="text-11-4">
<p>
Recently gotten into <code>meson</code> as a nice <code>cmake</code> alternative for smaller projects (maybe larger ones too).
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> meson-mode<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org71438c4" class="outline-3">
<h3 id="org71438c4"><span class="section-number-3">11.5.</span> Tup Mode</h3>
<div class="outline-text-3" id="text-11-5">
<p>
Because honestly there isn&rsquo;t anything better than <a href="http://gittup.org/tup/">tup</a>. Who doesn&rsquo;t need a build
system which <a href="http://gittup.org/tup/tup_vs_mordor.html">scales with the eye of Mordor</a>?
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> tup-mode
<span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github
           <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"ejmr/tup-mode"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org02b0343" class="outline-4">
<h4 id="org02b0343"><span class="section-number-4">11.5.1.</span> LATER Caveats</h4>
<div class="outline-text-4" id="text-11-5-1">
<p>
The repo is unmaintained so I ought to fork it and take a look into maintaining it.
</p>
</div>
</div>
</div>
<div id="outline-container-orgca19f13" class="outline-3">
<h3 id="orgca19f13"><span class="section-number-3">11.6.</span> SaltStack Mode</h3>
<div class="outline-text-3" id="text-11-6">
<p>
I have recently decided that <a href="https://saltstack.com/">saltstack</a> ought to be used for working on multiple
systems.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> salt-mode
<span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github
         <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"glynnforrest/salt-mode"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5f22408" class="outline-3">
<h3 id="org5f22408"><span class="section-number-3">11.7.</span> PKGBUILD Mode</h3>
<div class="outline-text-3" id="text-11-7">
<p>
No point using <code>emacs</code> if I can&rsquo;t get highlighting for all my needs. This needs
some extra configuration. <del>Must figure out if this is well mantained</del>. The
developer is very responsive to pull requests and the like.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> pkgbuild-mode
  <span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github
            <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"juergenhoetzel/pkgbuild-mode"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd40d29c" class="outline-3">
<h3 id="orgd40d29c"><span class="section-number-3">11.8.</span> LAMMPS Mode</h3>
<div class="outline-text-3" id="text-11-8">
<p>
<del>This could do with some updates. Will look into this soon. Also it takesunbearably long this way. Must figure out how to stop it from downloading the
whole repo.</del>
Mantained <a href="https://github.com/HaoZeke/lammps-mode">by me</a> now.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> lammps-mode
  <span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github
                    <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"HaoZeke/lammps-mode"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf5a7d0a" class="outline-3">
<h3 id="orgf5a7d0a"><span class="section-number-3">11.9.</span> Pug Mode</h3>
<div class="outline-text-3" id="text-11-9">
<p>
I just like pugs.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> pug-mode<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
