packages.el

;; [[file:~/.config/doom/packages.org::*Dockerfile Mode][Dockerfile Mode:1]]
(package! dockerfile-mode)
;; Dockerfile Mode:1 ends here

;; [[file:~/.config/doom/packages.org::*Zotero][Zotero:1]]
(package! zotxt)
;; Zotero:1 ends here

;; [[file:~/.config/doom/packages.org::*Tup Mode][Tup Mode:1]]
(package! tup-mode
:recipe (:host github
           :repo "ejmr/tup-mode"))
;; Tup Mode:1 ends here

;; [[file:~/.config/doom/packages.org::*SaltStack Mode][SaltStack Mode:1]]
(package! salt-mode
:recipe (:host github
         :repo "glynnforrest/salt-mode"))
;; SaltStack Mode:1 ends here

;; [[file:~/.config/doom/packages.org::*PKGBUILD Mode][PKGBUILD Mode:1]]
(package! pkgbuild-mode
  :recipe (:host github
            :repo "juergenhoetzel/pkgbuild-mode"))
;; PKGBUILD Mode:1 ends here

;; [[file:~/.config/doom/packages.org::*LAMMPS Mode][LAMMPS Mode:1]]
(package! lammps-mode
  :recipe (:host github
                    :repo "HaoZeke/lammps-mode"))
;; LAMMPS Mode:1 ends here

;; [[file:~/.config/doom/packages.org::*Pug Mode][Pug Mode:1]]
(package! pug-mode)
;; Pug Mode:1 ends here
