packages.org
*** Nix Mode
For building more cross-os stuff. This is the [[https://github.com/NixOS/nix-mode][official package]], but will look
into binding and using [[https://github.com/travisbhartwell/nix-emacs][nix-emacs]] as well.
#+BEGIN_SRC emacs-lisp :tangle yes
(package! nix-mode)
#+END_SRC
*** VIM mode
I like ~vim-script~... well no I don't but I still use it.
#+begin_src emacs-lisp :tangle yes
(package! vimrc-mode)
#+end_src
*** JVM Languages
Currently the languages I care about (apart from Java) are:
#+BEGIN_SRC emacs-lisp :tangle yes
; Kotlin > Java
(package! kotlin-mode)
; Groovy -> Testing
(package! groovy-mode)
#+END_SRC
*** Systemd Mode
Since I use a lot of user systemd units, it makes sense to have pretty
highlighting.
#+BEGIN_SRC emacs-lisp :tangle yes
(package! systemd)
#+END_SRC
*** Dart Mode
Might eventually want to also get the companion [[https://github.com/bradyt/dart-server][dart server]] sometime, but for
now this syntax-highlighter will do. Might actually want to see if ~prettier~
has anything for it.
#+BEGIN_SRC emacs-lisp :tangle no
(package! dart-mode)
#+END_SRC
*** Wolfram Mode
Actually ~wolfram-mode~ seems to be able to do more than just syntax highlighting, but at the moment I just need font-locking.
#+BEGIN_SRC emacs-lisp :tangle yes
(package! wolfram-mode)
#+END_SRC
*** Polymode
For working with ~.Rmd~ files and better ~orgmode~ R support.
#+BEGIN_SRC emacs-lisp :tangle yes
(package! poly-R)
(package! poly-org)
#+END_SRC
*** Snakemake
Font locking for ~.smk~ files as they are evidently called (from [[https://github.com/kyleam/snakemake-mode][here]]).
#+BEGIN_SRC emacs-lisp :tangle yes
(package! snakemake-mode)
#+END_SRC
** Matrix Clients
Apparently Riot.im is now Element.io; and I could do with an ~emacs~ client...
#+begin_src emacs-lisp :tangle no
(package! pretty-hydra)
(package! matrix-client :recipe (:host github :repo "alphapapa/matrix-client.el"))
#+end_src
** Flycheck Additions
*** MELPA Helper
This is for linting files before submitting to MELPA.
#+BEGIN_SRC emacs-lisp :tangle yes
(package! package-lint)
(package! flycheck-package)
#+END_SRC
** Snippets
These are from [[https://github.com/hlissner][hlissner]].
*** Doom
#+BEGIN_SRC emacs-lisp :tangle yes
(package! emacs-snippets
  :recipe (:host github
           :repo "hlissner/emacs-snippets"
           :files ("*")))
#+END_SRC
*** Standard
These are from the [[https://github.com/AndreaCrotti/yasnippet-snippets][official snippets repo]].
#+BEGIN_SRC emacs-lisp :tangle yes
(package! yasnippet-snippets
  :recipe (:host github
           :repo "AndreaCrotti/yasnippet-snippets"
           :files ("*")))
#+END_SRC
** Math support
I like [[https://github.com/cdominik/cdlatex][cdlatex]].
#+BEGIN_SRC emacs-lisp :tangle yes
(package! cdlatex)
#+END_SRC
However, better support for symbols can be found in ~math-symbol-lists~ as [[https://www.emacswiki.org/emacs/TeXInputMethod][discussed here]].
#+begin_src emacs-lisp :tangle yes
(package! math-symbol-lists)
#+end_src
Also, [[https://github.com/johnbcoughlin/calctex][CalcTeX]] makes life a lot easier, and is faster than calling SymPy or Mathematica.
#+begin_src emacs-lisp :tangle yes
(package! calctex :recipe (:host github :repo "johnbcoughlin/calctex"
                           :files ("*.el" "calctex/*.el" "calctex-contrib/*.el" "org-calctex/*.el" "vendor"))
  :pin "784cf911bc96aac0f47d529e8cee96ebd7cc31c9")
#+end_src

# Local Variables:
# eval: (add-hook (quote after-save-hook) (lambda nil (org-babel-tangle)) nil t)
# End:
