docs/packages.html
<div id="outline-container-org1906901" class="outline-3">
<h3 id="org1906901"><span class="section-number-3">11.10.</span> Nix Mode</h3>
<div class="outline-text-3" id="text-11-10">
<p>
For building more cross-os stuff. This is the <a href="https://github.com/NixOS/nix-mode">official package</a>, but will look
into binding and using <a href="https://github.com/travisbhartwell/nix-emacs">nix-emacs</a> as well.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> nix-mode<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf1dd217" class="outline-3">
<h3 id="orgf1dd217"><span class="section-number-3">11.11.</span> VIM mode</h3>
<div class="outline-text-3" id="text-11-11">
<p>
I like <code>vim-script</code>&#x2026; well no I don&rsquo;t but I still use it.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> vimrc-mode<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org415c708" class="outline-3">
<h3 id="org415c708"><span class="section-number-3">11.12.</span> JVM Languages</h3>
<div class="outline-text-3" id="text-11-12">
<p>
Currently the languages I care about (apart from Java) are:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #727072;">; </span><span style="color: #727072;">Kotlin &gt; Java</span>
<span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> kotlin-mode<span style="color: #AB9DF2;">)</span>
<span style="color: #727072;">; </span><span style="color: #727072;">Groovy -&gt; Testing</span>
<span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> groovy-mode<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8606104" class="outline-3">
<h3 id="org8606104"><span class="section-number-3">11.13.</span> Systemd Mode</h3>
<div class="outline-text-3" id="text-11-13">
<p>
Since I use a lot of user systemd units, it makes sense to have pretty
highlighting.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> systemd<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6ea8e7f" class="outline-3">
<h3 id="org6ea8e7f"><span class="section-number-3">11.14.</span> Dart Mode</h3>
<div class="outline-text-3" id="text-11-14">
<p>
Might eventually want to also get the companion <a href="https://github.com/bradyt/dart-server">dart server</a> sometime, but for
now this syntax-highlighter will do. Might actually want to see if <code>prettier</code>
has anything for it.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> dart-mode<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5dae54b" class="outline-3">
<h3 id="org5dae54b"><span class="section-number-3">11.15.</span> Wolfram Mode</h3>
<div class="outline-text-3" id="text-11-15">
<p>
Actually <code>wolfram-mode</code> seems to be able to do more than just syntax highlighting, but at the moment I just need font-locking.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> wolfram-mode<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc75b6dc" class="outline-3">
<h3 id="orgc75b6dc"><span class="section-number-3">11.16.</span> Polymode</h3>
<div class="outline-text-3" id="text-11-16">
<p>
For working with <code>.Rmd</code> files and better <code>orgmode</code> R support.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> poly-R<span style="color: #AB9DF2;">)</span>
<span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> poly-org<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdb6d893" class="outline-3">
<h3 id="orgdb6d893"><span class="section-number-3">11.17.</span> Snakemake</h3>
<div class="outline-text-3" id="text-11-17">
<p>
Font locking for <code>.smk</code> files as they are evidently called (from <a href="https://github.com/kyleam/snakemake-mode">here</a>).
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> snakemake-mode<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0babbcd" class="outline-2">
<h2 id="org0babbcd"><span class="section-number-2">12.</span> Matrix Clients</h2>
<div class="outline-text-2" id="text-12">
<p>
Apparently Riot.im is now Element.io; and I could do with an <code>emacs</code> client&#x2026;
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> pretty-hydra<span style="color: #AB9DF2;">)</span>
<span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> matrix-client <span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"alphapapa/matrix-client.el"</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org98f7f73" class="outline-2">
<h2 id="org98f7f73"><span class="section-number-2">13.</span> Flycheck Additions</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org0ec2424" class="outline-3">
<h3 id="org0ec2424"><span class="section-number-3">13.1.</span> MELPA Helper</h3>
<div class="outline-text-3" id="text-13-1">
<p>
This is for linting files before submitting to MELPA.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> package-lint<span style="color: #AB9DF2;">)</span>
<span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> flycheck-package<span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb5e5403" class="outline-2">
<h2 id="orgb5e5403"><span class="section-number-2">14.</span> Snippets</h2>
<div class="outline-text-2" id="text-14">
<p>
These are from <a href="https://github.com/hlissner">hlissner</a>.
</p>
</div>
<div id="outline-container-orgee3de81" class="outline-3">
<h3 id="orgee3de81"><span class="section-number-3">14.1.</span> Doom</h3>
<div class="outline-text-3" id="text-14-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> emacs-snippets
  <span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github
           <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"hlissner/emacs-snippets"</span>
           <span style="color: #78DCE8;">:files</span> <span style="color: #FC9867;">(</span><span style="color: #FFD866;">"*"</span><span style="color: #FC9867;">)</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8f38e27" class="outline-3">
<h3 id="org8f38e27"><span class="section-number-3">14.2.</span> Standard</h3>
<div class="outline-text-3" id="text-14-2">
<p>
These are from the <a href="https://github.com/AndreaCrotti/yasnippet-snippets">official snippets repo</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> yasnippet-snippets
  <span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github
           <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"AndreaCrotti/yasnippet-snippets"</span>
           <span style="color: #78DCE8;">:files</span> <span style="color: #FC9867;">(</span><span style="color: #FFD866;">"*"</span><span style="color: #FC9867;">)</span><span style="color: #78DCE8;">)</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org38e9d9e" class="outline-2">
<h2 id="org38e9d9e"><span class="section-number-2">15.</span> Math support</h2>
<div class="outline-text-2" id="text-15">
<p>
I like <a href="https://github.com/cdominik/cdlatex">cdlatex</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> cdlatex<span style="color: #AB9DF2;">)</span>
</pre>
</div>
<p>
However, better support for symbols can be found in <code>math-symbol-lists</code> as <a href="https://www.emacswiki.org/emacs/TeXInputMethod">discussed here</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> math-symbol-lists<span style="color: #AB9DF2;">)</span>
</pre>
</div>
<p>
Also, <a href="https://github.com/johnbcoughlin/calctex">CalcTeX</a> makes life a lot easier, and is faster than calling SymPy or Mathematica.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">package!</span> calctex <span style="color: #78DCE8;">:recipe</span> <span style="color: #78DCE8;">(</span><span style="color: #78DCE8;">:host</span> github <span style="color: #78DCE8;">:repo</span> <span style="color: #FFD866;">"johnbcoughlin/calctex"</span>
                           <span style="color: #78DCE8;">:files</span> <span style="color: #FC9867;">(</span><span style="color: #FFD866;">"*.el"</span> <span style="color: #FFD866;">"calctex/*.el"</span> <span style="color: #FFD866;">"calctex-contrib/*.el"</span> <span style="color: #FFD866;">"org-calctex/*.el"</span> <span style="color: #FFD866;">"vendor"</span><span style="color: #FC9867;">)</span><span style="color: #78DCE8;">)</span>
  <span style="color: #78DCE8;">:pin</span> <span style="color: #FFD866;">"784cf911bc96..."</span><span style="color: #AB9DF2;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020:04:09</p>
<p class="author">Author: Rohit Goswami (HaoZeke) &lt;rohit.goswami@aol.com&gt;</p>
<p class="date">Created: 2022-12-24 Sat 13:53</p>
</div>
</body>
</html>