packages.el

;; [[file:~/.config/doom/packages.org::*Nix Mode][Nix Mode:1]]
(package! nix-mode)
;; Nix Mode:1 ends here

;; [[file:~/.config/doom/packages.org::*JVM Languages][JVM Languages:1]]
; Kotlin > Java
(package! kotlin-mode)
; Groovy -> Testing
(package! groovy-mode)
;; JVM Languages:1 ends here

;; [[file:~/.config/doom/packages.org::*Systemd Mode][Systemd Mode:1]]
(package! systemd)
;; Systemd Mode:1 ends here

;; [[file:~/.config/doom/packages.org::*Wolfram Mode][Wolfram Mode:1]]
(package! wolfram-mode)
;; Wolfram Mode:1 ends here

;; [[file:~/.config/doom/packages.org::*Polymode][Polymode:1]]
(package! poly-R)
(package! poly-org)
;; Polymode:1 ends here

;; [[file:~/.config/doom/packages.org::*MELPA Helper][MELPA Helper:1]]
(package! package-lint)
(package! flycheck-package)
;; MELPA Helper:1 ends here

;; [[file:~/.config/doom/packages.org::*Doom][Doom:1]]
(package! emacs-snippets
  :recipe (:host github
           :repo "hlissner/emacs-snippets"
           :files ("*")))
;; Doom:1 ends here

;; [[file:~/.config/doom/packages.org::*Standard][Standard:1]]
(package! yasnippet-snippets
  :recipe (:host github
           :repo "AndreaCrotti/yasnippet-snippets"
           :files ("*")))
;; Standard:1 ends here

;; [[file:~/.config/doom/packages.org::*Math support][Math support:1]]
(package! cdlatex)
;; Math support:1 ends here
